{
  "book-review-mindset": {
    "title": "Mindset - Book Review",
    "date": "2023-11-25",
    "image": "/mindsetBook.jpg",
    "content": [
      {
        "type": "paragraph",
        "text": "When I joined Sprinklr, they gave me this book called 'Mindset' in my welcome package. I wasn't quite in the habit of reading at the time, hadn't been for many years. What a shame, honestly. Mindset was the most influential book I read this year. It has completely changed the way I view challenges and opportunities in life. I no longer rely on the crutches of words like 'talent', 'natural skill', 'incompatible', 'luck' to explain my inadequacies and others' adequacies."
      },
      {
        "type": "image",
        "src": "/mindsetBook.jpg",
        "alt": "Mindset Book"
      },
      {
        "type": "paragraph",
        "text": "The entire book revolves around the concept of Fixed Mindset vs Growth Mindset. How even stuff we, growing up, are led to believe is fixed such as IQ, musical talent, sporty talent, is all buildable. There are innumerable research studies supporting this. As long as you put in the work, grind hard, you will be in an incredible position to achieve whatever you set out to conquer. It is all in your head. Everything is learnable. Except for the top 0.01% of the world, Talent is indistinguishable from Hard Work, for any 'innate property' or skill. "
      },
      {
        "type": "paragraph",
        "text": "At it's core, the book is very preachy, something I both like and hate. It discredits the ideas in the book when they are shared with such factual aplomb, but no wonder the author considers these things facts having implemented them into their own life. An excellent book."
      }
    ]
  },
  "book-review-ikigai": {
    "title": "Ikigai - Book Review",
    "date": "2023-11-27",
    "image": "/ikigaiBook.jpg",
    "content": [
      {
        "type": "paragraph",
        "text": "Ikigai is a book I picked up simply because of its popularity. Honestly? Not a fan. It delves into the main factors of staying alive longer, doing a case study on the people on an island off Japan who tend to live extremely long lives. The main point of the book is to find your 'purpose of living - ikigai', something that resonates with you, the people around you, does good for everyone and earns you a good livelihood. It also promotes a simpler diet and eat less processed foods and even eat less meat (the last one I disagree with, at least for white meat)."
      },
      {
        "type": "image",
        "src": "/ikigaiBook.jpg",
        "alt": "Ikigai Book"
      },
      {
        "type": "paragraph",
        "text": "To me, it seemed like the book just encourages 'work till you die'. I think happiness and long life can be separate from having a job to do, it mostly depends on financial stability. The less you have to struggle to meet basic needs, the less stress you will get, the longer you will live. Survivorship bias is also unaddressed in the book -- what is to say that it is the things these people are doing that let them live a long life compared to what they aren't doing? Regardless, it's a decent read. Just eat healthy, stay fit, and don't do stressful stuff and you'll be fine."
      }
    ]
  },
  "book-review-crucial-conversations": {
    "title": "Crucial Conversations Book Review",
    "date": "2023-11-30",
    "image": "/crucialConversationsBook.jpg",
    "content": [
      {
        "type": "image",
        "src": "/crucialConversationsBook.jpg",
        "alt": "Crucial Conversations Book"
      },
      {
        "type": "paragraph",
        "text": "Many copies of this book were kept away in the office library, something no one bothers to read, of course. Again, though, it is a brilliant book. It goes into how to bring people to the negotiating table, even if they don't agree with you. I can't quite encapsulate this book in a review, it feels like a must-read. The main idea is just, be aware of your defense mechanisms, and be aware of everyone else's. Ignoring you, being sarcastic, being angry are all defense mechanisms -- fundamentally everyone wants to feel safe, at peace, and without any stressors. You can achieve that as long as you are in control of your own emotions and defense mechanisms. Learn to control your reactions and the world is yours to take."
      }
    ]
  }
}